In [1]:
import pandas as pd
import numpy as np

In [5]:
miaserie = pd.Series([4,5,7.33,2])
print(miaserie)
#non indicizzata

miaserie2 = pd.Series([4,5,7.33,2],index=['primo','secondo','terzo','quarto'])
print(miaserie2)
#indicizzata

0    4.00
1    5.00
2    7.33
3    2.00
dtype: float64
primo      4.00
secondo    5.00
terzo      7.33
quarto     2.00
dtype: float64

In [6]:
d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
   ....:      'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

In [13]:
df = pd.DataFrame(d)

In [14]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [15]:
df['one'] # select by column

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [10]:
df['one']['a']

1.0

In [12]:
df.loc['b'] # select by row label

one    2.0
two    2.0
Name: b, dtype: float64

In [19]:
df.iloc[2] # select by row index

one    3.0
two    3.0
Name: c, dtype: float64

In [12]:
d['two']+d['one']
#cmq somma in base all'indice (la chiave per la somma è l'indice)
ser1 = pd.Series([1,2,3], index=['b','a','c'])
ser2 = pd.Series([15,8,9], index=['a','b','c'])
ser1+ser2

a    17
b     9
c    12
dtype: int64

In [20]:
df.loc[df['one']>1] # select row conditional SELECT * FROM DF WHERE ONE > 1

   one  two
b  2.0  2.0
c  3.0  3.0

In [16]:
df[df['one']>1] # same as before but shorter

   one  two
b  2.0  2.0
c  3.0  3.0

In [21]:
df[df['one']>1]['two'] # SELECT TWO FROM DF WHERE ONE > 1

b    2.0
c    3.0
Name: two, dtype: float64

In [17]:
#Transpose
df[:].T

       a    b    c    d
one  1.0  2.0  3.0  NaN
two  1.0  2.0  3.0  4.0

In [19]:
df2 = pd.DataFrame(np.random.rand(5,80))
print(df2)

         0         1         2         3         4         5         6   \
0  0.924395  0.351617  0.677111  0.377823  0.174035  0.177969  0.809061
1  0.003374  0.412436  0.517592  0.544976  0.804041  0.632892  0.729735
2  0.472400  0.255054  0.476357  0.271065  0.887073  0.828703  0.111377
3  0.412270  0.085408  0.289507  0.241113  0.325856  0.987520  0.046170
4  0.813258  0.886901  0.318725  0.434961  0.968542  0.686747  0.156879

         7         8         9   ...        70        71        72        73  \
0  0.894282  0.737534  0.498608  ...  0.532723  0.877730  0.765417  0.064730
1  0.394838  0.796637  0.483712  ...  0.685384  0.352490  0.680258  0.818303
2  0.413770  0.129882  0.995131  ...  0.843696  0.115801  0.563078  0.550383
3  0.853087  0.255447  0.368316  ...  0.871749  0.656858  0.444908  0.930420
4  0.722707  0.938533  0.752139  ...  0.290290  0.786604  0.101116  0.665788

         74        75        76        77        78        79
0  0.781353  0.328173  0.776532  0.471883  0.250559  0.053731
1  0.808523  0.521124  0.338809  0.202881  0.323864  0.079149
2  0.284316  0.237388  0.231677  0.376983  0.611973  0.331904
3  0.329642  0.422192  0.007025  0.153964  0.250174  0.016825
4  0.798916  0.196371  0.233764  0.890596  0.316805  0.691969

[5 rows x 80 columns]

In [25]:
#posso sliciare per riga, colonna, pezzi di riga o pezzi di colonna
df2.iloc[2]
#riga2

0     0.472400
1     0.255054
2     0.476357
3     0.271065
4     0.887073
5     0.828703
6     0.111377
7     0.413770
8     0.129882
9     0.995131
10    0.150208
11    0.599692
12    0.385426
13    0.076966
14    0.300831
15    0.229568
16    0.804541
17    0.614677
18    0.938373
19    0.390313
20    0.949379
21    0.699703
22    0.324991
23    0.871411
24    0.389504
25    0.101381
26    0.693144
27    0.017352
28    0.951471
29    0.732369
        ...
50    0.249288
51    0.904339
52    0.198189
53    0.607390
54    0.876691
55    0.635185
56    0.313410
57    0.778818
58    0.486811
59    0.133040
60    0.451965
61    0.924031
62    0.884821
63    0.901517
64    0.092076
65    0.524904
66    0.650211
67    0.063018
68    0.189388
69    0.429564
70    0.843696
71    0.115801
72    0.563078
73    0.550383
74    0.284316
75    0.237388
76    0.231677
77    0.376983
78    0.611973
79    0.331904
Name: 2, Length: 80, dtype: float64

In [26]:
df2[2]
#colonna2

0    0.677111
1    0.517592
2    0.476357
3    0.289507
4    0.318725
Name: 2, dtype: float64

In [29]:
df2.loc[(df2[1]>1) & (df2[2]<3)]

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79]
Index: []

[0 rows x 80 columns]